RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
/* Bit definition for Ethernet MAC Frame Filter Register */
#define ETH_MACFFLT_RA   ((uint32_t)0x80000000) /* Receive all */
#define ETH_MACFFLT_HPF  ((uint32_t)0x00000400) /* Hash or perfect filter */
#define ETH_MACFFLT_SAF  ((uint32_t)0x00000200) /* Source address filter enable */
#define ETH_MACFFLT_SAIF ((uint32_t)0x00000100) /* SA inverse filtering */
#define ETH_MACFFLT_PCF  ((uint32_t)0x000000C0) /* Pass control frames: 3 cases */
#define ETH_MACFFLT_PCF_BLOCK_ALL                                                                                      \
    ((uint32_t)0x00000040) /* MAC filters all control frames from reaching the application */
#define ETH_MACFFLT_PCF_FORWARD_ALL                                                                                    \
    ((uint32_t)0x00000080) /* MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_MACFFLT_PCF_FORWARD_PASSED_ADDR_FILTER                                                                     \
    ((uint32_t)0x000000C0)                      /* MAC forwards control frames that pass the Address Filter. */
#define ETH_MACFFLT_DBF  ((uint32_t)0x00000020) /* Broadcast frame disable */
#define ETH_MACFFLT_PAM  ((uint32_t)0x00000010) /* Pass all mutlicast */
#define ETH_MACFFLT_DAIF ((uint32_t)0x00000008) /* DA Inverse filtering */
#define ETH_MACFFLT_HMC  ((uint32_t)0x00000004) /* Hash multicast */
#define ETH_MACFFLT_HUC  ((uint32_t)0x00000002) /* Hash unicast */
#define ETH_MACFFLT_PRM  ((uint32_t)0x00000001) /* Promiscuous mode */

/* Bit definition for Ethernet MAC Hash Table High Register */
#define ETH_MACHASHHI_HTH ((uint32_t)0xFFFFFFFF) /* Hash table high */

/* Bit definition for Ethernet MAC Hash Table Low Register */
#define ETH_MACHASHLO_HTL ((uint32_t)0xFFFFFFFF) /* Hash table low */

/* Bit definition for Ethernet MAC MII Address Register */
#define ETH_MACMIIADDR_PA       ((uint32_t)0x0000F800) /* Physical layer address */
#define ETH_MACMIIADDR_MR       ((uint32_t)0x000007C0) /* MII register in the selected PHY */
#define ETH_MACMIIADDR_CR       ((uint32_t)0x0000001C) /* CTRL clock range: 6 cases */
#define ETH_MACMIIADDR_CR_DIV42 ((uint32_t)0x00000000) /* HCLK:60-100 MHz; MDC clock= HCLK/42 */
#define ETH_MACMIIADDR_CR_DIV62 ((uint32_t)0x00000004) /* HCLK:100-144 MHz; MDC clock= HCLK/62 */
#define ETH_MACMIIADDR_CR_DIV16 ((uint32_t)0x00000008) /* HCLK:20-35 MHz; MDC clock= HCLK/16 */
#define ETH_MACMIIADDR_CR_DIV26 ((uint32_t)0x0000000C) /* HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ETH_MACMIIADDR_MW       ((uint32_t)0x00000002) /* MII write */
#define ETH_MACMIIADDR_MB       ((uint32_t)0x00000001) /* MII busy */

/* Bit definition for Ethernet MAC MII Data Register */
#define ETH_MACMIIDAT_MD ((uint32_t)0x0000FFFF) /* MII data: read/write data from/to PHY */

/* Bit definition for Ethernet MAC Flow Control Register */
#define ETH_MACFLWCTRL_PT           ((uint32_t)0xFFFF0000) /* Pause time */
#define ETH_MACFLWCTRL_DZQP         ((uint32_t)0x00000080) /* Zero-quanta pause disable */
#define ETH_MACFLWCTRL_PLT          ((uint32_t)0x00000030) /* Pause low threshold: 4 cases */
#define ETH_MACFLWCTRL_PLT_MINUS4   ((uint32_t)0x00000000) /* Pause time minus 4 slot times */
#define ETH_MACFLWCTRL_PLT_MINUS28  ((uint32_t)0x00000010) /* Pause time minus 28 slot times */
#define ETH_MACFLWCTRL_PLT_MINUS144 ((uint32_t)0x00000020) /* Pause time minus 144 slot times */
#define ETH_MACFLWCTRL_PLT_MINUS256 ((uint32_t)0x00000030) /* Pause time minus 256 slot times */
#define ETH_MACFLWCTRL_UP           ((uint32_t)0x00000008) /* Unicast pause frame detect */
#define ETH_MACFLWCTRL_RFE          ((uint32_t)0x00000004) /* Receive flow control enable */
#define ETH_MACFLWCTRL_TFE          ((uint32_t)0x00000002) /* Transmit flow control enable */
#define ETH_MACFLWCTRL_FCB_BPA      ((uint32_t)0x00000001) /* Flow control busy/backpressure activate */

/* Bit definition for Ethernet MAC VLAN Tag Register */
#define ETH_MACVLANTAG_ETC  ((uint32_t)0x00010000) /* 12-bit VLAN tag comparison */
#define ETH_MACVLANTAG_VLTI ((uint32_t)0x0000FFFF) /* VLAN tag identifier (for receive frames) */

/* Bit definition for Ethernet MAC Remote Wake-UpFrame Filter Register */
#define ETH_MACRMTWUFRMFLT_DAT ((uint32_t)0xFFFFFFFF) /* Wake-up frame filter register data */
/* Eight sequential Writes to this address (offset 0x28) will write all Wake-UpFrame Filter Registers.
   Eight sequential Reads from this address (offset 0x28) will read all Wake-UpFrame Filter Registers. */
/* Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
   Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
   Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
   Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
   Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command -
                              RSVD - Filter1 Command - RSVD - Filter0 Command
   Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
   Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
   Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

/* Bit definition for Ethernet MAC PMT Control and Status Register */
#define ETH_MACPMTCTRLSTS_RWKUPFLTRST ((uint32_t)0x80000000) /* Wake-Up Frame Filter Register Pointer Reset */
#define ETH_MACPMTCTRLSTS_GLBLUCAST   ((uint32_t)0x00000200) /* Global Unicast */
#define ETH_MACPMTCTRLSTS_RWKPRCVD    ((uint32_t)0x00000040) /* Wake-Up Frame Received */
#define ETH_MACPMTCTRLSTS_MGKPRCVD    ((uint32_t)0x00000020) /* Magic Packet Received */
#define ETH_MACPMTCTRLSTS_RWKPKTEN    ((uint32_t)0x00000004) /* Wake-Up Frame Enable */
#define ETH_MACPMTCTRLSTS_MGKPKTEN    ((uint32_t)0x00000002) /* Magic Packet Enable */
#define ETH_MACPMTCTRLSTS_PWRDWN      ((uint32_t)0x00000001) /* Power Down */

/* Bit definition for Ethernet MAC Status Register */
#define ETH_MACINTSTS_TSTS    ((uint32_t)0x00000200) /* Time stamp trigger status */
#define ETH_MACINTSTS_MMCTXIS ((uint32_t)0x00000040) /* MMC transmit status */
#define ETH_MACINTSTS_MMCRXIS ((uint32_t)0x00000020) /* MMC receive status */
#define ETH_MACINTSTS_MMCIS   ((uint32_t)0x00000010) /* MMC status */
#define ETH_MACINTSTS_PMTIS   ((uint32_t)0x00000008) /* PMT status */

