RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
/* Bit definition for Ethernet MAC Interrupt Mask Register */
#define ETH_MACINTMSK_TSIM  ((uint32_t)0x00000200) /* Time stamp trigger interrupt mask */
#define ETH_MACINTMSK_PMTIM ((uint32_t)0x00000008) /* PMT interrupt mask */

/* Bit definition for Ethernet MAC Address0 High Register */
#define ETH_MACADDR0HI_ADDRHI ((uint32_t)0x0000FFFF) /* MAC address0 high */

/* Bit definition for Ethernet MAC Address0 Low Register */
#define ETH_MACADDR0LO_ADDRLO ((uint32_t)0xFFFFFFFF) /* MAC address0 low */

/* Bit definition for Ethernet MAC Address1 High Register */
#define ETH_MACADDR1HI_AE ((uint32_t)0x80000000) /* Address enable */
#define ETH_MACADDR1HI_SA ((uint32_t)0x40000000) /* Source address */
#define ETH_MACADDR1HI_MBC                                                                                             \
    ((uint32_t)0x3F000000) /* Mask byte control: bits to mask for comparison of the MAC Address bytes */
#define ETH_MACADDR1HI_MBC_HBITS15_8  ((uint32_t)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACADDR1HI_MBC_HBITS7_0   ((uint32_t)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACADDR1HI_MBC_LBITS31_24 ((uint32_t)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACADDR1HI_MBC_LBITS23_16 ((uint32_t)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACADDR1HI_MBC_LBITS15_8  ((uint32_t)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACADDR1HI_MBC_LBITS7_0   ((uint32_t)0x01000000) /* Mask MAC Address low reg bits [7:0] */
#define ETH_MACADDR1HI_ADDRHI         ((uint32_t)0x0000FFFF) /* MAC address1 high */

/* Bit definition for Ethernet MAC Address1 Low Register */
#define ETH_MACADDR1LO_ADDRLO ((uint32_t)0xFFFFFFFF) /* MAC address1 low */

/* Bit definition for Ethernet MAC Address2 High Register */
#define ETH_MACADDR2HI_AE             ((uint32_t)0x80000000) /* Address enable */
#define ETH_MACADDR2HI_SA             ((uint32_t)0x40000000) /* Source address */
#define ETH_MACADDR2HI_MBC            ((uint32_t)0x3F000000) /* Mask byte control */
#define ETH_MACADDR2HI_MBC_HBITS15_8  ((uint32_t)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACADDR2HI_MBC_HBITS7_0   ((uint32_t)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACADDR2HI_MBC_LBITS31_24 ((uint32_t)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACADDR2HI_MBC_LBITS23_16 ((uint32_t)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACADDR2HI_MBC_LBITS15_8  ((uint32_t)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACADDR2HI_MBC_LBITS7_0   ((uint32_t)0x01000000) /* Mask MAC Address low reg bits [70] */
#define ETH_MACADDR2HI_ADDRHI         ((uint32_t)0x0000FFFF) /* MAC address1 high */

/* Bit definition for Ethernet MAC Address2 Low Register */
#define ETH_MACADDR2LO_ADDRLO ((uint32_t)0xFFFFFFFF) /* MAC address2 low */

/* Bit definition for Ethernet MAC Address3 High Register */
#define ETH_MACADDR3HI_AE             ((uint32_t)0x80000000) /* Address enable */
#define ETH_MACADDR3HI_SA             ((uint32_t)0x40000000) /* Source address */
#define ETH_MACADDR3HI_MBC            ((uint32_t)0x3F000000) /* Mask byte control */
#define ETH_MACADDR3HI_MBC_HBITS15_8  ((uint32_t)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACADDR3HI_MBC_HBITS7_0   ((uint32_t)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACADDR3HI_MBC_LBITS31_24 ((uint32_t)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACADDR3HI_MBC_LBITS23_16 ((uint32_t)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACADDR3HI_MBC_LBITS15_8  ((uint32_t)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACADDR3HI_MBC_LBITS7_0   ((uint32_t)0x01000000) /* Mask MAC Address low reg bits [70] */
#define ETH_MACADDR3HI_ADDRHI         ((uint32_t)0x0000FFFF) /* MAC address3 high */

/* Bit definition for Ethernet MAC Address3 Low Register */
#define ETH_MACADDR3LO_ADDRLO ((uint32_t)0xFFFFFFFF) /* MAC address3 low */

/******************************************************************************/
/*                Ethernet MMC Registers bits definition                      */
/******************************************************************************/

/* Bit definition for Ethernet MMC Contol Register */
#define ETH_MMCCTRL_CNTFREEZ  ((uint32_t)0x00000008) /* MMC Counter Freeze */
#define ETH_MMCCTRL_RSTONRD   ((uint32_t)0x00000004) /* Reset on Read */
#define ETH_MMCCTRL_CNTSTOPRO ((uint32_t)0x00000002) /* Counter Stop Rollover */
#define ETH_MMCCTRL_CNTRST    ((uint32_t)0x00000001) /* Counters Reset */

/* Bit definition for Ethernet MMC Receive Interrupt Register */
#define ETH_MMCRXINT_RXUCGFIS                                                                                          \
    ((uint32_t)0x00020000) /* Set when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRXINT_RXALGNERFIS                                                                                       \
    ((uint32_t)0x00000040) /* Set when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRXINT_RXCRCERFIS                                                                                        \
    ((uint32_t)0x00000020) /* Set when Rx crc error counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Register */
#define ETH_MMCTXINT_TXGFRMIS                                                                                          \
    ((uint32_t)0x00200000) /* Set when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTXINT_TXMCOLGFIS                                                                                        \
    ((uint32_t)0x00008000) /* Set when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTXINT_TXSCOLGFIS                                                                                        \
    ((uint32_t)0x00004000) /* Set when Tx good single col counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Receive Interrupt Mask Register */
#define ETH_MMCRXINTMSK_RXUCGFIM                                                                                       \
    ((uint32_t)0x00020000) /* Mask the interrupt when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRXINTMSK_RXALGNERFIM                                                                                    \
    ((uint32_t)0x00000040) /* Mask the interrupt when when Rx alignment error counter reaches half the maximum value   \
                            */
#define ETH_MMCRXINTMSK_RXCRCERFIM                                                                                     \
    ((uint32_t)0x00000020) /* Mask the interrupt when Rx crc error counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Mask Register */
#define ETH_MMCTXINTMSK_TXGFRMIM                                                                                       \
    ((uint32_t)0x00200000) /* Mask the interrupt when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTXINTMSK_TXMCOLGFIM                                                                                     \
    ((uint32_t)0x00008000) /* Mask the interrupt when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTXINTMSK_TXSCOLGFIM                                                                                     \
    ((uint32_t)0x00004000) /* Mask the interrupt when Tx good single col counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmitted Good Frames after Single Collision Counter Register */
#define ETH_MMCTXGFASCCNT_CNT                                                                                          \
    ((uint32_t)0xFFFFFFFF) /* Number of successfully transmitted frames after a single collision in Half-duplex mode.  \
                            */

/* Bit definition for Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register */
#define ETH_MMCTXGFAMSCCNT_CNT                                                                                         \
    ((uint32_t)0xFFFFFFFF) /* Number of successfully transmitted frames after more than a single collision in          \
                              Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames Counter Register */
#define ETH_MMCTXGFCNT_CNT ((uint32_t)0xFFFFFFFF) /* Number of good frames transmitted. */

