RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
/* Bit definition for Ethernet DMA Transmit Poll Demand Register */
#define ETH_DMATXPD_TPD ((uint32_t)0xFFFFFFFF) /* Transmit poll demand */

/* Bit definition for Ethernet DMA Receive Poll Demand Register */
#define ETH_DMARXPD_RPD ((uint32_t)0xFFFFFFFF) /* Receive poll demand  */

/* Bit definition for Ethernet DMA Receive Descriptor List Address Register */
#define ETH_DMARXDLADDR_SRL ((uint32_t)0xFFFFFFFF) /* Start of receive list */

/* Bit definition for Ethernet DMA Transmit Descriptor List Address Register */
#define ETH_DMATXDLADDR_STL ((uint32_t)0xFFFFFFFF) /* Start of transmit list */

/* Bit definition for Ethernet DMA Status Register */
#define ETH_DMASTS_TTI  ((uint32_t)0x20000000) /* Time-stamp trigger status */
#define ETH_DMASTS_PMTI ((uint32_t)0x10000000) /* PMT status */
#define ETH_DMASTS_MMCI ((uint32_t)0x08000000) /* MMC status */
#define ETH_DMASTS_EB   ((uint32_t)0x03800000) /* Error bits status */
/* combination with EBS[2:0] for GetFlagStatus function */
#define ETH_DMASTS_EB_DESC_ACC   ((uint32_t)0x02000000) /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASTS_EB_READ       ((uint32_t)0x01000000) /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASTS_EB_WRITE      ((uint32_t)0x00800000) /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMASTS_TPS           ((uint32_t)0x00700000) /* Transmit process state */
#define ETH_DMASTS_TPS_STOPPED   ((uint32_t)0x00000000) /* Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASTS_TPS_FETCHING  ((uint32_t)0x00100000) /* Running - fetching the Tx descriptor */
#define ETH_DMASTS_TPS_WAITING   ((uint32_t)0x00200000) /* Running - waiting for status */
#define ETH_DMASTS_TPS_READING   ((uint32_t)0x00300000) /* Running - reading the data from host memory */
#define ETH_DMASTS_TPS_SUSPENDED ((uint32_t)0x00600000) /* Suspended - Tx Descriptor unavailabe */
#define ETH_DMASTS_TPS_CLOSING   ((uint32_t)0x00700000) /* Running - closing Rx descriptor */
#define ETH_DMASTS_RPS           ((uint32_t)0x000E0000) /* Receive process state */
#define ETH_DMASTS_RPS_STOPPED   ((uint32_t)0x00000000) /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASTS_RPS_FETCHING  ((uint32_t)0x00020000) /* Running - fetching the Rx descriptor */
#define ETH_DMASTS_RPS_WAITING   ((uint32_t)0x00060000) /* Running - waiting for packet */
#define ETH_DMASTS_RPS_SUSPENDED ((uint32_t)0x00080000) /* Suspended - Rx Descriptor unavailable */
#define ETH_DMASTS_RPS_CLOSING   ((uint32_t)0x000A0000) /* Running - closing descriptor */
#define ETH_DMASTS_RPS_QUEUING   ((uint32_t)0x000E0000) /* Running - queuing the recieve frame into host memory */
#define ETH_DMASTS_NIS           ((uint32_t)0x00010000) /* Normal interrupt summary */
#define ETH_DMASTS_AIS           ((uint32_t)0x00008000) /* Abnormal interrupt summary */
#define ETH_DMASTS_ERI           ((uint32_t)0x00004000) /* Early receive status */
#define ETH_DMASTS_FBI           ((uint32_t)0x00002000) /* Fatal bus error status */
#define ETH_DMASTS_ETI           ((uint32_t)0x00000400) /* Early transmit status */
#define ETH_DMASTS_RWT           ((uint32_t)0x00000200) /* Receive watchdog timeout status */
#define ETH_DMASTS_RPSS          ((uint32_t)0x00000100) /* Receive process stopped status */
#define ETH_DMASTS_RU            ((uint32_t)0x00000080) /* Receive buffer unavailable status */
#define ETH_DMASTS_RI            ((uint32_t)0x00000040) /* Receive status */
#define ETH_DMASTS_UNF           ((uint32_t)0x00000020) /* Transmit underflow status */
#define ETH_DMASTS_OVF           ((uint32_t)0x00000010) /* Receive overflow status */
#define ETH_DMASTS_TJT           ((uint32_t)0x00000008) /* Transmit jabber timeout status */
#define ETH_DMASTS_TU            ((uint32_t)0x00000004) /* Transmit buffer unavailable status */
#define ETH_DMASTS_TPSS          ((uint32_t)0x00000002) /* Transmit process stopped status */
#define ETH_DMASTS_TI            ((uint32_t)0x00000001) /* Transmit status */

/* Bit definition for Ethernet DMA Operation Mode Register */
#define ETH_DMAOPMOD_DT          ((uint32_t)0x04000000) /* Disable Dropping of TCP/IP checksum error frames */
#define ETH_DMAOPMOD_RSF         ((uint32_t)0x02000000) /* Receive store and forward */
#define ETH_DMAOPMOD_DFF         ((uint32_t)0x01000000) /* Disable flushing of received frames */
#define ETH_DMAOPMOD_TSF         ((uint32_t)0x00200000) /* Transmit store and forward */
#define ETH_DMAOPMOD_FTF         ((uint32_t)0x00100000) /* Flush transmit DATFIFO */
#define ETH_DMAOPMOD_TTC         ((uint32_t)0x0001C000) /* Transmit threshold control */
#define ETH_DMAOPMOD_TTC_64BYTES ((uint32_t)0x00000000) /* threshold level of the MTL Transmit DATFIFO is 64 Bytes */
#define ETH_DMAOPMOD_TTC_128BYTES                                                                                      \
    ((uint32_t)0x00004000) /* threshold level of the MTL Transmit DATFIFO is 128 Bytes                                 \
                            */
#define ETH_DMAOPMOD_TTC_192BYTES                                                                                      \
    ((uint32_t)0x00008000) /* threshold level of the MTL Transmit DATFIFO is 192 Bytes                                 \
                            */
#define ETH_DMAOPMOD_TTC_256BYTES                                                                                      \
    ((uint32_t)0x0000C000)                               /* threshold level of the MTL Transmit DATFIFO is 256 Bytes   \
                                                          */
#define ETH_DMAOPMOD_TTC_40BYTES  ((uint32_t)0x00010000) /* threshold level of the MTL Transmit DATFIFO is 40 Bytes */
#define ETH_DMAOPMOD_TTC_32BYTES  ((uint32_t)0x00014000) /* threshold level of the MTL Transmit DATFIFO is 32 Bytes */
#define ETH_DMAOPMOD_TTC_24BYTES  ((uint32_t)0x00018000) /* threshold level of the MTL Transmit DATFIFO is 24 Bytes */
#define ETH_DMAOPMOD_TTC_16BYTES  ((uint32_t)0x0001C000) /* threshold level of the MTL Transmit DATFIFO is 16 Bytes */
#define ETH_DMAOPMOD_ST           ((uint32_t)0x00002000) /* Start/stop transmission command */
#define ETH_DMAOPMOD_FEF          ((uint32_t)0x00000080) /* Forward error frames */
#define ETH_DMAOPMOD_FUF          ((uint32_t)0x00000040) /* Forward undersized good frames */
#define ETH_DMAOPMOD_RTC          ((uint32_t)0x00000018) /* receive threshold control */
#define ETH_DMAOPMOD_RTC_64BYTES  ((uint32_t)0x00000000) /* threshold level of the MTL Receive DATFIFO is 64 Bytes */
#define ETH_DMAOPMOD_RTC_32BYTES  ((uint32_t)0x00000008) /* threshold level of the MTL Receive DATFIFO is 32 Bytes */
#define ETH_DMAOPMOD_RTC_96BYTES  ((uint32_t)0x00000010) /* threshold level of the MTL Receive DATFIFO is 96 Bytes */
#define ETH_DMAOPMOD_RTC_128BYTES ((uint32_t)0x00000018) /* threshold level of the MTL Receive DATFIFO is 128 Bytes */
#define ETH_DMAOPMOD_OSF          ((uint32_t)0x00000004) /* operate on second frame */
#define ETH_DMAOPMOD_SR           ((uint32_t)0x00000002) /* Start/stop receive */

/* Bit definition for Ethernet DMA Interrupt Enable Register */
#define ETH_DMAINTEN_NISE ((uint32_t)0x00010000) /* Normal interrupt summary enable */
#define ETH_DMAINTEN_AISE ((uint32_t)0x00008000) /* Abnormal interrupt summary enable */
#define ETH_DMAINTEN_ERIE ((uint32_t)0x00004000) /* Early receive interrupt enable */
#define ETH_DMAINTEN_FBIE ((uint32_t)0x00002000) /* Fatal bus error interrupt enable */
#define ETH_DMAINTEN_ETIE ((uint32_t)0x00000400) /* Early transmit interrupt enable */
#define ETH_DMAINTEN_RWTE ((uint32_t)0x00000200) /* Receive watchdog timeout interrupt enable */
#define ETH_DMAINTEN_RPSE ((uint32_t)0x00000100) /* Receive process stopped interrupt enable */
#define ETH_DMAINTEN_RUE  ((uint32_t)0x00000080) /* Receive buffer unavailable interrupt enable */
#define ETH_DMAINTEN_RIE  ((uint32_t)0x00000040) /* Receive interrupt enable */
#define ETH_DMAINTEN_UNFE ((uint32_t)0x00000020) /* Transmit Underflow interrupt enable */
#define ETH_DMAINTEN_OVFE ((uint32_t)0x00000010) /* Receive Overflow interrupt enable */
#define ETH_DMAINTEN_TJTE ((uint32_t)0x00000008) /* Transmit jabber timeout interrupt enable */
#define ETH_DMAINTEN_TUE  ((uint32_t)0x00000004) /* Transmit buffer unavailable interrupt enable */
#define ETH_DMAINTEN_TPSE ((uint32_t)0x00000002) /* Transmit process stopped interrupt enable */
#define ETH_DMAINTEN_TIE  ((uint32_t)0x00000001) /* Transmit interrupt enable */

/* Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register */
#define ETH_DMAMFBOCNT_OVFCNTOVF ((uint32_t)0x10000000) /* Overflow bit for DATFIFO overflow counter */
#define ETH_DMAMFBOCNT_OVFFRMCNT ((uint32_t)0x0FFE0000) /* Number of frames missed by the application */
#define ETH_DMAMFBOCNT_MISCNTOVF ((uint32_t)0x00010000) /* Overflow bit for missed frame counter */
#define ETH_DMAMFBOCNT_MISFRMCNT ((uint32_t)0x0000FFFF) /* Number of frames missed by the controller */

/* Bit definition for Ethernet DMA Current Host Transmit Descriptor Register */
#define ETH_DMACHTXDESC_ADDR ((uint32_t)0xFFFFFFFF) /* Host transmit descriptor address pointer */

