RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
/*******************  Bit definition for QSPI_MW_CTRL register  *******************/
#define QSPI_MW_CTRL_MWMOD                          ((uint32_t)0x00000001) /*!< MWMO (Microwire Transfer Mode) */
#define QSPI_MW_CTRL_MWMOD_UNSEQUENTIAL                     ((uint32_t)0x00000000)
#define QSPI_MW_CTRL_MWMOD_SEQUENTIAL                           ((uint32_t)0x00000001)

#define QSPI_MW_CTRL_MC_DIR                         ((uint32_t)0x00000002) /*!< MC_DIR (Direction of Data when Microwire Control) */
#define QSPI_MW_CTRL_MC_DIR_RX                              ((uint32_t)0x00000000)
#define QSPI_MW_CTRL_MC_DIR_TX                              ((uint32_t)0x00000002)

#define QSPI_MW_CTRL_MHS_EN                         ((uint32_t)0x00000004) /*!< MHS_EN (Microwire Handshaking Enable) */

/*******************  Bit definition for QSPI_SLAVE_EN register  *******************/
#define QSPI_SLAVE_EN_SEN                           ((uint32_t)0x00000001) /*!< SEN (Slave Enable) */

/*******************  Bit definition for QSPI_BAUD register  *******************/
#define QSPI_BAUD_CLK_DIV                           ((uint32_t)0x0000FFFF) /*!< CLK_DIV[15:0] (Clock Divider) */
#define QSPI_BAUD_CLK_DIV_0                         ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_BAUD_CLK_DIV_1                         ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_BAUD_CLK_DIV_2                         ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_BAUD_CLK_DIV_3                         ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_BAUD_CLK_DIV_4                         ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_BAUD_CLK_DIV_5                         ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_BAUD_CLK_DIV_6                         ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_BAUD_CLK_DIV_7                         ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_BAUD_CLK_DIV_8                         ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_BAUD_CLK_DIV_9                         ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_BAUD_CLK_DIV_10                        ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_BAUD_CLK_DIV_11                        ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_BAUD_CLK_DIV_12                        ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_BAUD_CLK_DIV_13                        ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_BAUD_CLK_DIV_14                        ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_BAUD_CLK_DIV_15                        ((uint32_t)0x00008000) /*!< Bit 15 */

/*******************  Bit definition for QSPI_TXFT register  *******************/
#define QSPI_TXFT_ST                                ((uint32_t)0x0000001F) /*!< TXFT_ST[4:0] (Transmit FIFO Threshold to Start to Transfer) */
#define QSPI_TXFT_ST_0                              ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_TXFT_ST_1                              ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_TXFT_ST_2                              ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_TXFT_ST_3                              ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_TXFT_ST_4                              ((uint32_t)0x00000010) /*!< Bit 4 */

#define QSPI_TXFT_TEI                               ((uint32_t)0x0000001F) /*!< TXFT_TEI[4:0] (Transmit FIFO Threshold to Trigger Empty Interrupt) */
#define QSPI_TXFT_TEI_0                             ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_TXFT_TEI_1                             ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_TXFT_TEI_2                             ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_TXFT_TEI_3                             ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_TXFT_TEI_4                             ((uint32_t)0x00000010) /*!< Bit 4 */

/*******************  Bit definition for QSPI_RXFT register  *******************/
#define QSPI_RXFT_TFI                               ((uint32_t)0x0000001F) /*!< RXFT_TFI[4:0] (Receive FIFO Threshold to Trigger Full Interrupt) */
#define QSPI_RXFT_TFI_0                             ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_RXFT_TFI_1                             ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_RXFT_TFI_2                             ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_RXFT_TFI_3                             ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_RXFT_TFI_4                             ((uint32_t)0x00000010) /*!< Bit 4 */

/*******************  Bit definition for QSPI_TXFN register  *******************/
#define QSPI_TXFN                                   ((uint32_t)0x0000003F) /*!< TXFN[5:0] (Numver of Transmit FIFO) */
#define QSPI_TXFN_0                                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_TXFN_1                                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_TXFN_2                                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_TXFN_3                                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_TXFN_4                                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_TXFN_5                                 ((uint32_t)0x00000020) /*!< Bit 5 */

/*******************  Bit definition for QSPI_RXFN register  *******************/
#define QSPI_RXFN                                   ((uint32_t)0x0000003F) /*!< RXFN[5:0] (Numver of Receive FIFO) */
#define QSPI_RXFN_0                                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_RXFN_1                                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_RXFN_2                                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_RXFN_3                                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_RXFN_4                                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_RXFN_5                                 ((uint32_t)0x00000020) /*!< Bit 5 */

/*******************  Bit definition for QSPI_STS register  *******************/
#define QSPI_STS                                    ((uint32_t)0x0000007F) /*!< STS[6:0] (status flag) */
#define QSPI_STS_BUSY                               ((uint32_t)0x00000001) /*!< BUSY (Transfer Busy Flag) */
#define QSPI_STS_TXFNF                              ((uint32_t)0x00000002) /*!< TXFNF (Transmit FIFO not Full) */
#define QSPI_STS_TXFE                               ((uint32_t)0x00000004) /*!< TXFE (Transmit FIFO not Empty) */
#define QSPI_STS_RXFNE                              ((uint32_t)0x00000008) /*!< RXFNE (Receive FIFO not Empty) */
#define QSPI_STS_RXFF                               ((uint32_t)0x00000010) /*!< RXFF (Receive FIFO not Full) */
#define QSPI_STS_TX_ERR                             ((uint32_t)0x00000020) /*!< TX_ERR (Transmit Error) */
#define QSPI_STS_DC_ERR                                 ((uint32_t)0x00000040) /*!< DC_ERR (Data Conflict Error) */

