RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
/*******************  Bit definition for QSPI_IMASK register  *******************/
#define QSPI_IMASK                                  ((uint32_t)0x0000007F) /*!< IMASK[6:0] (Interrupt of Mask) */
#define QSPI_IMASK_TXFEIM                           ((uint32_t)0x00000001) /*!< TXFEIM (Transmit FIFO Empty Interrupt Mask) */
#define QSPI_IMASK_TXFOIM                           ((uint32_t)0x00000002) /*!< TXFOIM (Transmit FIFO Overflow Interrupt Mask) */
#define QSPI_IMASK_RXFUIM                           ((uint32_t)0x00000004) /*!< RXFUIM (Receive FIFO Underflow Interrupt Mask) */
#define QSPI_IMASK_RXFOIM                           ((uint32_t)0x00000008) /*!< RXFOIM (Receive FIFO Overflow Interrupt Mask) */
#define QSPI_IMASK_RXFFIM                           ((uint32_t)0x00000010) /*!< RXFFIM (Receive FIFO Full Interrupt Mask) */
#define QSPI_IMASK_MMCIM                            ((uint32_t)0x00000020) /*!< MMCIM (Multi-Master Contention Interrupt Mask) */
#define QSPI_IMASK_XRXOIM                           ((uint32_t)0x00000040) /*!< XRXOIM (XIP Receive FIFO Overflow Interrupt Mask) */

/*******************  Bit definition for QSPI_ISTS register  *******************/
#define QSPI_ISTS                                  ((uint32_t)0x0000007F) /*!< All bits of interrupt stasus */
#define QSPI_ISTS_TXFEIS                           ((uint32_t)0x00000001) /*!< TXFEIS (Transmit FIFO Empty Interrupt Stasus) */
#define QSPI_ISTS_TXFOIS                           ((uint32_t)0x00000002) /*!< TXFOIS (Transmit FIFO Overflow Interrupt Stasus) */
#define QSPI_ISTS_RXFUIS                           ((uint32_t)0x00000004) /*!< RXFUIS (Receive FIFO Underflow Interrupt Stasus) */
#define QSPI_ISTS_RXFOIS                           ((uint32_t)0x00000008) /*!< RXFOIS (Receive FIFO Overflow Interrupt Stasus) */
#define QSPI_ISTS_RXFFIS                           ((uint32_t)0x00000010) /*!< RXFFIS (Receive FIFO Full Interrupt Stasus) */
#define QSPI_ISTS_MMCIS                            ((uint32_t)0x00000020) /*!< MMCIS (Multi-Master Contention Interrupt Stasus) */
#define QSPI_ISTS_XRXOIS                           ((uint32_t)0x00000040) /*!< XRXOIS (XIP Receive FIFO Overflow Interrupt Stasus) */

/*******************  Bit definition for QSPI_RISTS register  *******************/
#define QSPI_RISTS                                  ((uint32_t)0x0000007F) /*!< All bits of raw interrupt stasus */
#define QSPI_RISTS_TXFERIS                          ((uint32_t)0x00000001) /*!< TXFERIS (Transmit FIFO Empty Raw Interrupt Stasus) */
#define QSPI_RISTS_TXFORIS                          ((uint32_t)0x00000002) /*!< TXFORIS (Transmit FIFO Overflow Raw Interrupt Stasus) */
#define QSPI_RISTS_RXFURIS                          ((uint32_t)0x00000004) /*!< RXFURIS (Receive FIFO Underflow Raw Interrupt Stasus) */
#define QSPI_RISTS_RXFORIS                          ((uint32_t)0x00000008) /*!< RXFORIS (Receive FIFO Overflow Raw Interrupt Stasus) */
#define QSPI_RISTS_RXFFRIS                          ((uint32_t)0x00000010) /*!< RXFFRIS (Receive FIFO Full Raw Interrupt Stasus) */
#define QSPI_RISTS_MMCRIS                           ((uint32_t)0x00000020) /*!< MMCRIS (Multi-Master Contention Raw Interrupt Stasus) */
#define QSPI_RISTS_XRXORIS                          ((uint32_t)0x00000040) /*!< XRXORIS (XIP Receive FIFO Overflow Raw Interrupt Stasus) */

/*******************  Bit definition for QSPI_TXFOI_CLR register  *******************/
#define QSPI_TXFOI_CLR_TXFOIC                       ((uint32_t)0x00000001) /*!< TXFOIC (Clear Transmit FIFO Overflow Interrupt) */

/*******************  Bit definition for QSPI_RXFOI_CLR register  *******************/
#define QSPI_RXFOI_CLR_RXFOIC                       ((uint32_t)0x00000001) /*!< RXFOIC (Clear Receive FIFO Overflow Interrupt) */

/*******************  Bit definition for QSPI_RXFUI_CLR register  *******************/
#define QSPI_RXFUI_CLR_RXFUIC                       ((uint32_t)0x00000001) /*!< RXFUIC (Clear Receive FIFO Underflow Interrupt) */

/*******************  Bit definition for QSPI_MMCI_CLR register  *******************/
#define QSPI_MMCI_CLR_MMCIC                         ((uint32_t)0x00000001) /*!< MMCIC (Clear Multi-Master Contention Interrupt) */

/*******************  Bit definition for QSPI_ICLR register  *******************/
#define QSPI_ICLR_INTC                              ((uint32_t)0x00000001) /*!< INTC (Clear Interrupts) */

/*******************  Bit definition for QSPI_DMA_CTRL register  *******************/
#define QSPI_DMA_CTRL_RX_DMA_EN                     ((uint32_t)0x00000001) /*!< RX_DMA_EN (Receive DMA Enable) */
#define QSPI_DMA_CTRL_TX_DMA_EN                     ((uint32_t)0x00000002) /*!< TX_DMA_EN (Transmit DMA Enable) */

/*******************  Bit definition for QSPI_DMATDL_CTRL register  *******************/
#define QSPI_DMATDL_CTRL_DMATDL                     ((uint32_t)0x0000003F) /*!< DMATDL[5:0] (DMA Transmit Data Level) */
#define QSPI_DMATDL_CTRL_DMATDL_0                   ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_DMATDL_CTRL_DMATDL_1                   ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_DMATDL_CTRL_DMATDL_2                   ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_DMATDL_CTRL_DMATDL_3                   ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_DMATDL_CTRL_DMATDL_4                   ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_DMATDL_CTRL_DMATDL_5                   ((uint32_t)0x00000020) /*!< Bit 5 */

/*******************  Bit definition for QSPI_DMARDL_CTRL register  *******************/
#define QSPI_DMARDL_CTRL_DMARDL                     ((uint32_t)0x0000003F) /*!< DMARDL[5:0] (DMA Receive Data Level) */
#define QSPI_DMARDL_CTRL_DMARDL_0                   ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_DMARDL_CTRL_DMARDL_1                   ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_DMARDL_CTRL_DMARDL_2                   ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_DMARDL_CTRL_DMARDL_3                   ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_DMARDL_CTRL_DMARDL_4                   ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_DMARDL_CTRL_DMARDL_5                   ((uint32_t)0x00000020) /*!< Bit 5 */

