RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
/*******************  Bit definition for QSPI_IDCODE register  *******************/
#define QSPI_IDCODE                                 ((uint32_t)0x0000FFFF) /*!< IDCODE[31:0] (Identification Code) */
#define QSPI_IDCODE_0                               ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_IDCODE_1                               ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_IDCODE_2                               ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_IDCODE_3                               ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_IDCODE_4                               ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_IDCODE_5                               ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_IDCODE_6                               ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_IDCODE_7                               ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_IDCODE_8                               ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_IDCODE_9                               ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_IDCODE_10                              ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_IDCODE_11                              ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_IDCODE_12                              ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_IDCODE_13                              ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_IDCODE_14                              ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_IDCODE_15                              ((uint32_t)0x00008000) /*!< Bit 15 */
#define QSPI_IDCODE_16                              ((uint32_t)0x00010000) /*!< Bit 16 */
#define QSPI_IDCODE_17                              ((uint32_t)0x00020000) /*!< Bit 17 */
#define QSPI_IDCODE_18                              ((uint32_t)0x00040000) /*!< Bit 18 */
#define QSPI_IDCODE_19                              ((uint32_t)0x00080000) /*!< Bit 19 */
#define QSPI_IDCODE_20                              ((uint32_t)0x00100000) /*!< Bit 20 */
#define QSPI_IDCODE_21                              ((uint32_t)0x00200000) /*!< Bit 21 */
#define QSPI_IDCODE_22                              ((uint32_t)0x00400000) /*!< Bit 22 */
#define QSPI_IDCODE_23                              ((uint32_t)0x00800000) /*!< Bit 23 */
#define QSPI_IDCODE_24                              ((uint32_t)0x01000000) /*!< Bit 24 */
#define QSPI_IDCODE_25                              ((uint32_t)0x02000000) /*!< Bit 25 */
#define QSPI_IDCODE_26                              ((uint32_t)0x04000000) /*!< Bit 26 */
#define QSPI_IDCODE_27                              ((uint32_t)0x08000000) /*!< Bit 27 */
#define QSPI_IDCODE_28                              ((uint32_t)0x10000000) /*!< Bit 28 */
#define QSPI_IDCODE_29                              ((uint32_t)0x20000000) /*!< Bit 29 */
#define QSPI_IDCODE_30                              ((uint32_t)0x40000000) /*!< Bit 30 */
#define QSPI_IDCODE_31                              ((uint32_t)0x80000000) /*!< Bit 31 */

/*******************  Bit definition for QSPI_DAT0~QSPI_DAT31 register  *******************/
#define QSPI_DATA_ALL                               ((uint32_t)0x0000FFFF) /*!< QSPI_DAT[31:0] (DATA Register) */
#define QSPI_DATA_0                                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_DATA_1                                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_DATA_2                                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_DATA_3                                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_DATA_4                                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_DATA_5                                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_DATA_6                                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_DATA_7                                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_DATA_8                                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_DATA_9                                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_DATA_10                                ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_DATA_11                                ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_DATA_12                                ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_DATA_13                                ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_DATA_14                                ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_DATA_15                                ((uint32_t)0x00008000) /*!< Bit 15 */
#define QSPI_DATA_16                                ((uint32_t)0x00010000) /*!< Bit 16 */
#define QSPI_DATA_17                                ((uint32_t)0x00020000) /*!< Bit 17 */
#define QSPI_DATA_18                                ((uint32_t)0x00040000) /*!< Bit 18 */
#define QSPI_DATA_19                                ((uint32_t)0x00080000) /*!< Bit 19 */
#define QSPI_DATA_20                                ((uint32_t)0x00100000) /*!< Bit 20 */
#define QSPI_DATA_21                                ((uint32_t)0x00200000) /*!< Bit 21 */
#define QSPI_DATA_22                                ((uint32_t)0x00400000) /*!< Bit 22 */
#define QSPI_DATA_23                                ((uint32_t)0x00800000) /*!< Bit 23 */
#define QSPI_DATA_24                                ((uint32_t)0x01000000) /*!< Bit 24 */
#define QSPI_DATA_25                                ((uint32_t)0x02000000) /*!< Bit 25 */
#define QSPI_DATA_26                                ((uint32_t)0x04000000) /*!< Bit 26 */
#define QSPI_DATA_27                                ((uint32_t)0x08000000) /*!< Bit 27 */
#define QSPI_DATA_28                                ((uint32_t)0x10000000) /*!< Bit 28 */
#define QSPI_DATA_29                                ((uint32_t)0x20000000) /*!< Bit 29 */
#define QSPI_DATA_30                                ((uint32_t)0x40000000) /*!< Bit 30 */
#define QSPI_DATA_31                                ((uint32_t)0x80000000) /*!< Bit 31 */

