RT-Thread/rt-thread/bsp/n32/libraries/N32G45x_Firmware_Library/CMSIS/device/n32g45x.h
#define QSPI_ENH_CTRL0_SPI_DDR_EN                   ((uint32_t)0x00010000) /*!< SPI_DDR_EN (SPI DDR Enable) */
#define QSPI_ENH_CTRL0_INST_DDR_EN                  ((uint32_t)0x00020000) /*!< INST_DDR_EN (XIP instruction enable) */
#define QSPI_ENH_CTRL0_XIP_DFS_HC                   ((uint32_t)0x00080000) /*!< XIP_DFS_HC (Fix DFS for XIP transfers) */
#define QSPI_ENH_CTRL0_XIP_INST_EN                  ((uint32_t)0x00100000) /*!< XIP_INST_EN (XIP instruction enable) */
#define QSPI_ENH_CTRL0_XIP_CT_EN                    ((uint32_t)0x00200000) /*!< XIP_CT_EN (Enable Continuous Transfer in XIP mode) */

#define QSPI_ENH_CTRL0_XIP_MBL                      ((uint32_t)0x0C000000) /*!< XIP_MBL[1:0] (XIP Mode bits length) */
#define QSPI_ENH_CTRL0_XIP_MBL_0                    ((uint32_t)0x04000000) /*!< Bit 0 */
#define QSPI_ENH_CTRL0_XIP_MBL_1                    ((uint32_t)0x08000000) /*!< Bit 1 */
#define QSPI_ENH_CTRL0_XIP_MBL_2_BIT                            ((uint32_t)0x00000000)
#define QSPI_ENH_CTRL0_XIP_MBL_4_BIT                            ((uint32_t)0x04000000)
#define QSPI_ENH_CTRL0_XIP_MBL_8_BIT                            ((uint32_t)0x08000000)
#define QSPI_ENH_CTRL0_XIP_MBL_16_BIT                           ((uint32_t)0x0C000000)


#define QSPI_ENH_CTRL0_CLK_STRETCH_EN               ((uint32_t)0x40000000) /*!< CLK_STRETCH_EN (Enable Continuous Transfer in XIP mode) */

/*******************  Bit definition for QSPI_DDR_TXDE register  *******************/
#define QSPI_DDR_TXDE                               ((uint32_t)0x000000FF) /*!< TXDE[7:0] (Transmit Drive Edge) */
#define QSPI_DDR_TXDE_0                             ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_DDR_TXDE_1                             ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_DDR_TXDE_2                             ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_DDR_TXDE_3                             ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_DDR_TXDE_4                             ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_DDR_TXDE_5                             ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_DDR_TXDE_6                             ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_DDR_TXDE_7                             ((uint32_t)0x00000080) /*!< Bit 7 */

/*******************  Bit definition for QSPI_XIP_MODE register  *******************/
#define QSPI_XIP_MODE_XIP_MD_BITS          ((uint32_t)0x0000FFFF) /*!< XIP_MD_BITS[15:0] (XIP mode bits to be sent after address phase of XIP transfer) */
#define QSPI_XIP_MODE_XIP_MD_BITS_0        ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_XIP_MODE_XIP_MD_BITS_1        ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_XIP_MODE_XIP_MD_BITS_2        ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_XIP_MODE_XIP_MD_BITS_3        ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_XIP_MODE_XIP_MD_BITS_4        ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_XIP_MODE_XIP_MD_BITS_5        ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_XIP_MODE_XIP_MD_BITS_6        ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_XIP_MODE_XIP_MD_BITS_7        ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_XIP_MODE_XIP_MD_BITS_8        ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_XIP_MODE_XIP_MD_BITS_9        ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_XIP_MODE_XIP_MD_BITS_10       ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_XIP_MODE_XIP_MD_BITS_11       ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_XIP_MODE_XIP_MD_BITS_12       ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_XIP_MODE_XIP_MD_BITS_13       ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_XIP_MODE_XIP_MD_BITS_14       ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_XIP_MODE_XIP_MD_BITS_15       ((uint32_t)0x00008000) /*!< Bit 15 */

/*******************  Bit definition for QSPI_XIP_INCR_TOC register  *******************/
#define QSPI_XIP_INCR_TOC_ITOC             ((uint32_t)0x0000FFFF) /*!< ITOC[15:0] (XIP INCR transfer OpCode) */
#define QSPI_XIP_INCR_TOC_ITOC_0           ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_XIP_INCR_TOC_ITOC_1           ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_XIP_INCR_TOC_ITOC_2           ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_XIP_INCR_TOC_ITOC_3           ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_XIP_INCR_TOC_ITOC_4           ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_XIP_INCR_TOC_ITOC_5           ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_XIP_INCR_TOC_ITOC_6           ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_XIP_INCR_TOC_ITOC_7           ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_XIP_INCR_TOC_ITOC_8           ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_XIP_INCR_TOC_ITOC_9           ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_XIP_INCR_TOC_ITOC_10          ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_XIP_INCR_TOC_ITOC_11          ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_XIP_INCR_TOC_ITOC_12          ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_XIP_INCR_TOC_ITOC_13          ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_XIP_INCR_TOC_ITOC_14          ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_XIP_INCR_TOC_ITOC_15          ((uint32_t)0x00008000) /*!< Bit 15 */

/*******************  Bit definition for QSPI_XIP_WRAP_TOC register  *******************/
#define QSPI_XIP_WRAP_TOC_WTOC             ((uint32_t)0x0000FFFF) /*!< WTOC[15:0] (XIP WRAP transfer OpCode) */
#define QSPI_XIP_WRAP_TOC_WTOC_0           ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_XIP_WRAP_TOC_WTOC_1           ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_XIP_WRAP_TOC_WTOC_2           ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_XIP_WRAP_TOC_WTOC_3           ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_XIP_WRAP_TOC_WTOC_4           ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_XIP_WRAP_TOC_WTOC_5           ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_XIP_WRAP_TOC_WTOC_6           ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_XIP_WRAP_TOC_WTOC_7           ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_XIP_WRAP_TOC_WTOC_8           ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_XIP_WRAP_TOC_WTOC_9           ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_XIP_WRAP_TOC_WTOC_10          ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_XIP_WRAP_TOC_WTOC_11          ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_XIP_WRAP_TOC_WTOC_12          ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_XIP_WRAP_TOC_WTOC_13          ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_XIP_WRAP_TOC_WTOC_14          ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_XIP_WRAP_TOC_WTOC_15          ((uint32_t)0x00008000) /*!< Bit 15 */

/*******************  Bit definition for QSPI_XIP_CTRL register  *******************/
#define QSPI_XIP_CTRL_FRF                  ((uint32_t)0x00000003) /*!< FRF[1:0] (Frame format) */
#define QSPI_XIP_CTRL_FRF_0                ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_XIP_CTRL_FRF_1                ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_XIP_CTRL_FRF_2_LINE           ((uint32_t)0x00000001)
#define QSPI_XIP_CTRL_FRF_4_LINE           ((uint32_t)0x00000002)

#define QSPI_XIP_CTRL_TRANS_TYPE          ((uint32_t)0x00000003) /*!< TRANS_TYPE[1:0] (Address and instruction transfer format) */
#define QSPI_XIP_CTRL_TRANS_TYPE_0        ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_XIP_CTRL_TRANS_TYPE_1        ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_XIP_CTRL_TRANS_TYPE_STANDARD_SPI             ((uint32_t)0x00000000)
#define QSPI_XIP_CTRL_TRANS_TYPE_ADDRESS_BY_XIP_FRF     ((uint32_t)0x00000004)
#define QSPI_XIP_CTRL_TRANS_TYPE_INSTRUCT_BY_XIP_FRF    ((uint32_t)0x00000008)

